### Terraform Plan: `terraform/app`
```
data.archive_file.lambda: Reading...
data.archive_file.lambda: Read complete after 0s [id=d0a3b88dcded071d57b1301b2b43e60790150bc3]
aws_ssm_parameter.github_app_installation_id: Refreshing state... [id=/provision-demo/github-app-installation-id]
aws_secretsmanager_secret.github_app_key: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:762260382631:secret:provision-demo/github-app-private-key-h8Wz4P]
data.aws_caller_identity.current: Reading...
aws_iam_role.lambda: Refreshing state... [id=provision-demo-lambda-role]
aws_ssm_parameter.github_app_id: Refreshing state... [id=/provision-demo/github-app-id]
aws_secretsmanager_secret.age_secret_key: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:762260382631:secret:provision-demo/age-secret-key-t6TMBO]
aws_ssm_parameter.age_public_key: Refreshing state... [id=/provision-demo/age-public-key]
aws_lambda_layer_version.deps: Refreshing state... [id=arn:aws:lambda:us-east-1:762260382631:layer:provision-demo-deps:44]
aws_secretsmanager_secret.anthropic_api_key: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:762260382631:secret:provision-demo/anthropic-api-key-llxYwz]
aws_cognito_user_pool.main: Refreshing state... [id=us-east-1_o9swB8ulm]
data.aws_caller_identity.current: Read complete after 0s [id=762260382631]
aws_ssm_parameter.platform_repo: Refreshing state... [id=/provision-demo/platform-repo]
aws_secretsmanager_secret_version.github_app_key: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:762260382631:secret:provision-demo/github-app-private-key-h8Wz4P|terraform-20260326212930997900000003]
aws_secretsmanager_secret_version.anthropic_api_key: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:762260382631:secret:provision-demo/anthropic-api-key-llxYwz|terraform-20260329152930363900000002]
aws_secretsmanager_secret_version.age_secret_key: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:762260382631:secret:provision-demo/age-secret-key-t6TMBO|terraform-20260326212931000600000004]
aws_iam_role_policy_attachment.lambda_basic: Refreshing state... [id=provision-demo-lambda-role-20260326212931236000000005]
aws_kms_key.sops: Refreshing state... [id=f18b83eb-42d4-4630-9674-50b3c2ea13a9]
aws_kms_alias.sops: Refreshing state... [id=alias/provision-demo-sops]
aws_iam_role_policy.lambda_app: Refreshing state... [id=provision-demo-lambda-role:provision-demo-lambda-policy]
aws_cognito_user_pool_domain.main: Refreshing state... [id=provision-demo]
aws_lambda_function.app: Refreshing state... [id=provision-demo]
aws_lambda_permission.function_url_invoke: Refreshing state... [id=FunctionURLAllowPublicInvoke]
aws_lambda_permission.function_url: Refreshing state... [id=FunctionURLAllowPublicAccess]
aws_lambda_function_url.app: Refreshing state... [id=provision-demo]
aws_ssm_parameter.app_url: Refreshing state... [id=/provision-demo/app-url]
aws_cognito_user_pool_client.main: Refreshing state... [id=60dbkp0dnqo1ofqmugebg8at73]
aws_ssm_parameter.cognito_client_id: Refreshing state... [id=/provision-demo/cognito-client-id]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lambda_function.app will be updated in-place
  ~ resource "aws_lambda_function" "app" {
        id                             = "provision-demo"
      ~ last_modified                  = "2026-03-29T21:07:08.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-east-1:762260382631:layer:provision-demo-deps:44",
        ] -> (known after apply)
      ~ source_code_hash               = "WHxhQJldTPVsHk6OSRDWZGP05Qs1NtXm3MP/7VRbNAA=" -> "rHoKVtzq/QJ8YNGcsu4zBwCPHXSn0hUMNW19rpvByEc="
        tags                           = {}
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_layer_version.deps must be replaced
-/+ resource "aws_lambda_layer_version" "deps" {
      ~ arn                         = "arn:aws:lambda:us-east-1:762260382631:layer:provision-demo-deps:44" -> (known after apply)
      ~ code_sha256                 = "Ov535xOkAP9HxNyaulqISDmcz9czxCl82s/FkN2cnLE=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2026-03-29T21:07:02.282+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:us-east-1:762260382631:layer:provision-demo-deps:44" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:us-east-1:762260382631:layer:provision-demo-deps" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "Ov535xOkAP9HxNyaulqISDmcz9czxCl82s/FkN2cnLE=" -> "AGpTgYt7oyIHmmm0BvGM5VMxr0kUPnLwCaOnmReoCQg=" # forces replacement
      ~ source_code_size            = 6118323 -> (known after apply)
      ~ version                     = "44" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.out"

```
<!-- Sticky Pull Request Commentterraform-app -->